test/fixtures/webhooks/incoming/click_funnels/subscription_invoice_paid_payload.json

{
  "data": {
    "id": 5750950,
    "public_id": "EYXXEz",
    "order_id": 2853973,
    "status": "paid",
    "due_amount": "0.00",
    "total_amount": "1.00",
    "subtotal_amount": "1.00",
    "tax_amount": "0.00",
    "shipping_amount": "0.00",
    "discount_amount": "0.00",
    "currency": "USD",
    "issued_at": "2025-06-04T05:57:26.000Z",
    "due_at": null,
    "paid_at": "2025-06-04T05:57:31.000Z",
    "invoice_type": "initial",
    "invoice_number": "3",
    "fulfillment_status": "not_applicable",
    "created_at": "2025-06-04T05:57:33.510Z",
    "updated_at": "2025-06-04T05:57:34.071Z",
    "external_id": "in_1RWAKIGPAoiOInmaBPFewRLo",
    "payment_processor": "stripe",
    "eligible_for_fulfillment": true,
    "line_items": [
      {
        "id": 5552849,
        "public_id": "nXBnvW",
        "invoice_id": 5750950,
        "external_id": "il_1RWAKIGPAoiOInmaWUp0vO0n",
        "payment_type": "debit",
        "description": "1 × Funnels on Rails Premium Subscription (at $1.00 / month)",
        "quantity": 1,
        "fulfillment_status": "unfulfilled",
        "external_product_id": "products_variant_vNWWMb_Mxxlyz",
        "discount_amount": "0.0",
        "state_tax_amount": "0.0",
        "county_tax_amount": "0.0",
        "city_tax_amount": "0.0",
        "district_tax_amount": "0.0",
        "state_tax_rate": "0.0",
        "county_tax_rate": "0.0",
        "city_tax_rate": "0.0",
        "district_tax_rate": "0.0",
        "country_tax_jurisdiction": null,
        "state_tax_jurisdiction": null,
        "county_tax_jurisdiction": null,
        "city_tax_jurisdiction": null,
        "period_start_at": "2025-06-04T05:57:26.000Z",
        "period_end_at": "2025-07-04T05:57:26.000Z",
        "period_number": null,
        "created_at": "2025-06-04T05:57:33.681Z",
        "updated_at": "2025-06-04T05:57:33.681Z",
        "amount": "1.00",
        "products_price": {
          "id": 3791182,
          "public_id": "gVxaPy",
          "amount": "1.00",
          "currency": "usd",
          "duration": null,
          "interval": "months",
          "interval_count": 1
        },
        "products_variant": {
          "id": 4161570,
          "public_id": "Mxxlyz",
          "product_id": 775506,
          "name": "Funnels on Rails Premium Subscription",
          "description": "",
          "sku": "",
          "fulfillment_required": false
        }
      }
    ],
    "order": {
      "id": 2853973,
      "public_id": "WdPayA",
      "order_number": "#1003",
      "total_amount": "1.00",
      "origination_channel_id": 734075,
      "origination_channel_type": "Funnel",
      "notes": null,
      "live_mode": true,
      "in_trial": false,
      "billing_status": "paid",
      "service_status": "active",
      "order_type": "subscription-order",
      "next_charge_at": "2025-07-04T05:57:26.000Z",
      "trial_end_at": null,
      "tag_ids": [],
      "activated_at": "2025-06-04T05:57:33.000Z",
      "canceled_at": null,
      "canceled_by": null,
      "cancel_reason": null,
      "cancel_description": null,
      "churned_at": null,
      "shipping_address_first_name": "Rich",
      "shipping_address_last_name": "Cruz",
      "shipping_address_organization_name": null,
      "shipping_address_phone_number": null,
      "shipping_address_street_one": "Laurel",
      "shipping_address_street_two": "Zamboanga",
      "shipping_address_city": "Lilox",
      "shipping_address_region": "Zamboanga",
      "shipping_address_country": "PH",
      "shipping_address_postal_code": "8885",
      "billing_address_street_one": "Laurel",
      "billing_address_street_two": "Zamboanga",
      "billing_address_city": "Liloy",
      "billing_address_region": "Zamboanga",
      "billing_address_country": "PH",
      "billing_address_postal_code": "8885",
      "origination_channel_name": "Funnels on Rails Funnel",
      "contact": {
        "id": 593781252,
        "public_id": "GKgbKon",
        "workspace_id": 365069,
        "anonymous": 0,
        "email_address": "hey@rich.com",
        "first_name": "Rich",
        "last_name": "Cruz",
        "phone_number": null,
        "time_zone": null,
        "uuid": "f8d4489f-d066-4e83-b506-a3bc019c4c8f",
        "unsubscribed_at": null,
        "last_notification_email_sent_at": null,
        "fb_url": null,
        "twitter_url": null,
        "instagram_url": null,
        "linkedin_url": null,
        "website_url": null,
        "created_at": "2025-06-04T05:53:05.844Z",
        "updated_at": "2025-06-04T05:57:25.031Z",
        "tags": [],
        "custom_attributes": {},
        "visits": {
          "first_visit": {
            "id": 569674509,
            "public_id": "BkpQZRE",
            "contact_id": 593781252,
            "uuid": "cf8e0590-bcca-441d-b033-638aa4775ad6",
            "utm_source": null,
            "utm_medium": null,
            "utm_campaign": null,
            "utm_term": null,
            "utm_content": null,
            "ip": null,
            "user_agent": null,
            "referrer": null,
            "referring_domain": null,
            "landing_page": null,
            "browser": null,
            "os": null,
            "device_type": null,
            "started_at": null,
            "created_at": "2025-06-04T05:53:06.138Z",
            "updated_at": "2025-06-04T05:53:06.138Z"
          },
          "last_visit": null,
          "last_visit_with_utm": null
        }
      },
      "affiliate": null,
      "referral_code": null,
      "order_page": {
        "id": 19114200,
        "public_id": "NLGGNA",
        "name": "Copy of Optin -- 71e02"
      }
    },
    "visits": {
      "first_visit": {
        "id": 569674509,
        "public_id": "BkpQZRE",
        "contact_id": 593781252,
        "uuid": "cf8e0590-bcca-441d-b033-638aa4775ad6",
        "utm_source": null,
        "utm_medium": null,
        "utm_campaign": null,
        "utm_term": null,
        "utm_content": null,
        "ip": null,
        "user_agent": null,
        "referrer": null,
        "referring_domain": null,
        "landing_page": null,
        "browser": null,
        "os": null,
        "device_type": null,
        "started_at": null,
        "created_at": "2025-06-04T05:53:06.138Z",
        "updated_at": "2025-06-04T05:53:06.138Z"
      },
      "last_visit": null,
      "last_visit_with_utm": null
    }
  },
  "page": {
    "id": 19448806,
    "name": "Copy of Optin -- 1b4c9",
    "public_id": "PLxnGE"
  },
  "funnel": {
    "id": 753114,
    "name": "Local Testing Funnels on Rails Funnel",
    "public_id": "jgPKGv"
  },
  "event_id": "86dd8628-03b8-41b0-a382-8b3a31d6e525",
  "created_at": "2025-06-03T03:38:34.042Z",
  "event_type": "subscription.invoice.paid",
  "subject_id": 592504162,
  "api_version": 2,
  "subject_type": "Orders::Invoice",
  "workspace_id": 365069
}
